app/controllers/comments_controller.rb

	def approve
		@comment = Comment.find(params[:id])
		if @comment.update_attributes(approval: 1)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "comments" SET "approval" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["approval", "1"], ["updated_at", "2018-01-22 17:53:10.374106"], ["id", 7]]

	def create
		@comment = Comment.new(comment_params)
		@comment[:approval] = 0
		@comment[:deleted] = 0
	  if @comment.save
---
INSERT INTO "comments" ("author", "email", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def destroy
		@comment = Comment.find(params[:id])
		if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 10]]