app/controllers/posts_controller.rb

	def show
		@post = Post.find(params[:id])
		@comment = Comment.new
		@comments = Comment.where(post_id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]

	def create
		@post = Post.new(post_params)
	  if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)

	def update
		@post = Post.find(params[:id])
	  if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "null check"], ["body", "nope that worked"], ["updated_at", "2018-01-20 16:35:18.634749"], ["id", 3]]

	def destroy
		# hack to account for slugs
		id = params[:id].split('-')[0]
		@post = Post.find(id)
		if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?