app/controllers/stylesheets_controller.rb

	def index
		@sheets = Stylesheet.all.order(:order)
---
SELECT "stylesheets".* FROM "stylesheets" ORDER BY "stylesheets"."order" ASC

	def create
		@css = Stylesheet.new(stylesheet_params)
		if @css.order.blank?
			last = Stylesheet.order(:order).last
			@css.order = last.order.to_i + 1
		end
	  if @css.save
---
SELECT  "stylesheets".* FROM "stylesheets" ORDER BY "stylesheets"."order" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "stylesheets" ("body", "admin_id", "created_at", "updated_at", "name", "order") VALUES (?, ?, ?, ?, ?, ?)  [["body", "test"], ["admin_id", 1], ["created_at", "2018-01-23 16:02:07.814557"], ["updated_at", "2018-01-23 16:02:07.814557"], ["name", "new sheet"], ["order", 4]]

	def edit
		@css = Stylesheet.find(params[:id])
---
SELECT  "stylesheets".* FROM "stylesheets" WHERE "stylesheets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@css = Stylesheet.find(params[:id])
	  if @css.update_attributes(stylesheet_params)
---
SELECT  "stylesheets".* FROM "stylesheets" WHERE "stylesheets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stylesheets" SET "name" = ?, "body" = ?, "updated_at" = ? WHERE "stylesheets"."id" = ?  [["name", "second (blue)"], ["body", "body {color: white; background-color: #000;} a{color: blue;}"], ["updated_at", "2018-01-22 20:50:04.685075"], ["id", 1]]

	def toggle
		@css = Stylesheet.find(params[:id])
		if @css.active == 1
			if @css.update_attributes(active: 0)
---
SELECT  "stylesheets".* FROM "stylesheets" WHERE "stylesheets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stylesheets" SET "active" = ?, "updated_at" = ? WHERE "stylesheets"."id" = ?  [["active", 1], ["updated_at", "2018-01-22 20:30:05.509324"], ["id", 1]]