app/views/layouts/_head.html.erb

SELECT "stylesheets".* FROM "stylesheets"
---
 <!-- Bootstrap CSS CDN -->
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">